data_structure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Structure in Python and C++</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://orgmode.org/worg/style/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Data Structure in Python and C++</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgab6f8b6">Size</a></li>
<li><a href="#orgca314c2">Stack</a></li>
<li><a href="#org81170fb">Queue</a></li>
<li><a href="#orgd41c825">Priority Queue</a></li>
<li><a href="#org7c74e9c">Hash Map</a></li>
<li><a href="#org3870152">Hash Set</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgab6f8b6" class="outline-2">
<h2 id="orgab6f8b6">Size</h2>
<div class="outline-text-2" id="text-orgab6f8b6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Python</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>len(x)</code></td>
<td class="org-left"><code>x.empty()</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>x.size()</code></td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgca314c2" class="outline-2">
<h2 id="orgca314c2">Stack</h2>
<div class="outline-text-2" id="text-orgca314c2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Python</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>s = list()</code></td>
<td class="org-left"><code>std::stack&lt;int&gt; s;</code></td>
</tr>

<tr>
<td class="org-left"><code>s.append(x)</code></td>
<td class="org-left"><code>s.push(x);</code></td>
</tr>

<tr>
<td class="org-left"><code>yyy = s.pop()</code></td>
<td class="org-left"><code>s.pop();</code></td>
</tr>

<tr>
<td class="org-left"><code>s[-1]</code></td>
<td class="org-left"><code>s.top();</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org81170fb" class="outline-2">
<h2 id="org81170fb">Queue</h2>
<div class="outline-text-2" id="text-org81170fb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Python</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Queue</b></td>
<td class="org-left"><code>q = collections.deque()</code></td>
<td class="org-left"><code>std::queue&lt;int&gt; q;</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q.append()</code></td>
<td class="org-left"><code>q.push(xxx);</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>x = q.popleft()</code></td>
<td class="org-left"><code>q.pop();</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q[0]</code></td>
<td class="org-left"><code>q.front();</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Queue (thread safe)</b></td>
<td class="org-left"><code>q = Queue.Queue()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q.put(xxx)</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>yyy = q.get()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q.queue[0]</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgd41c825" class="outline-2">
<h2 id="orgd41c825">Priority Queue</h2>
<div class="outline-text-2" id="text-orgd41c825">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Python</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Priority queue</b></td>
<td class="org-left"><code>q = list() # smallest on top</code></td>
<td class="org-left"><code>std::priority_queue&lt;T&gt; q; // largest on top</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>heapq.heappush(q, x)</code></td>
<td class="org-left"><code>q.push(x);</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>y = heapq.heappop(q)</code></td>
<td class="org-left"><code>q.pop();</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q[0]</code></td>
<td class="org-left"><code>q.top();</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Priority queue (thread safe)</b></td>
<td class="org-left"><code>q = Queue.PriorityQueue()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q.put(x)</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>yyy = q.get()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q.queue[0]</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7c74e9c" class="outline-2">
<h2 id="org7c74e9c">Hash Map</h2>
<div class="outline-text-2" id="text-org7c74e9c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Python</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>d=dict()</code></td>
<td class="org-left"><code>std::unordered_map&lt;k_type,v_type&gt; d;</code></td>
</tr>

<tr>
<td class="org-left"><code>key in d</code></td>
<td class="org-left"><code>d.find(key) ! = d.end();</code></td>
</tr>

<tr>
<td class="org-left"><code>d[key]</code></td>
<td class="org-left"><code>d[key];</code></td>
</tr>

<tr>
<td class="org-left"><code>d[key] = value # change or insert</code></td>
<td class="org-left"><code>d[key] = value; // change or insert</code></td>
</tr>

<tr>
<td class="org-left"><code>for k, v in d.items():</code></td>
<td class="org-left"><code>for (auto iter:d) {iter-&gt;first; iter-&gt;second;}</code></td>
</tr>

<tr>
<td class="org-left"><code>for key in d:</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>del d[key]; # or d.pop(key)</code></td>
<td class="org-left"><code>d.erase(key); d.erase(iter);</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3870152" class="outline-2">
<h2 id="org3870152">Hash Set</h2>
<div class="outline-text-2" id="text-org3870152">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Python</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>s=set()</code></td>
<td class="org-left"><code>std::unordered_set&lt;int&gt; s;</code></td>
</tr>

<tr>
<td class="org-left"><code>item in s</code></td>
<td class="org-left"><code>s.find(item) ! = d.end();</code></td>
</tr>

<tr>
<td class="org-left"><code>s.add(item)</code></td>
<td class="org-left"><code>s.insert(item)</code></td>
</tr>

<tr>
<td class="org-left"><code>s.remove(item) # item has to be in</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>s.discard(item) # item can be not in</code></td>
<td class="org-left"><code>s.erase(item) // item can be not in s</code></td>
</tr>

<tr>
<td class="org-left"><code>for x in set</code></td>
<td class="org-left"><code>for (auto&amp; x:s) {x;}</code></td>
</tr>

<tr>
<td class="org-left"><code>s1.union(s2); s1</code> &vert; <code>s2</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>s1.intersection(s2); s1 &amp; s2</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>s1.difference(s2); s1 - s2</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<script src="https://utteranc.es/client.js"
        repo="sychen52/sychen52.github.io"
        issue-term="pathname"
        theme="github"
        crossorigin="anonymous"
        async>
</script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
